{"unknown": {"id": "0", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "p2000": {"id": "1", "description": "Accurate and controllable, the German-made P2000 is a serviceable first-round pistol that works best against unarmored opponents.", "magazine_size": 13, "Damage_per_bullet": 35, "Bullet_per_Sec": 0.17}, "glock": {"id": "2", "description": "The Glock 18 is a serviceable first-round pistol that works best against unarmored opponents and is capable of firing three-round bursts.", "magazine_size": 20, "Damage_per_bullet": 30, "Bullet_per_Sec": 0.15}, "p250": {"id": "3", "description": "A low-recoil firearm with a high rate of fire, the P250 is a relatively inexpensive choice against armored opponents.", "magazine_size": 13, "Damage_per_bullet": 38, "Bullet_per_Sec": 0.15}, "deagle": {"id": "4", "description": "As expensive as it is powerful, the Desert Eagle is an iconic pistol that is difficult to master but surprisingly accurate at long range.", "magazine_size": 7, "Damage_per_bullet": 53, "Bullet_per_Sec": 0.225}, "fiveseven": {"id": "5", "description": "Highly accurate and armor-piercing, the pricy Five-Seven is a slow-loader that compensates with a generous 20-round magazine and forgiving recoil.", "magazine_size": 20, "Damage_per_bullet": 32, "Bullet_per_Sec": 0.15}, "dualberettas": {"id": "6", "description": "Firing two large-mag Berettas at once will lower accuracy and increase load times. On the bright side, you'll get to fire two large-mag Berettas at once.", "magazine_size": 30, "Damage_per_bullet": 38, "Bullet_per_Sec": 0.12}, "tec9": {"id": "7", "description": "An ideal pistol for the Terrorist on the move, the Tec-9 is lethal in close quarters and features a high magazine capacity.", "magazine_size": 18, "Damage_per_bullet": 33, "Bullet_per_Sec": 0.12}, "cz": {"id": "8", "description": "A fully automatic variant of the CZ75, the CZ75-Auto is another inexpensive choice against armored opponents. But with very little ammo provided, strong trigger discipline is required.", "magazine_size": 12, "Damage_per_bullet": 31, "Bullet_per_Sec": 0.1}, "usp": {"id": "9", "description": "A fan favorite from Counter-Strike: Source, the Silenced USP Pistol has a detachable silencer that gives shots less recoil while suppressing attention-getting noise.", "magazine_size": 12, "Damage_per_bullet": 35, "Bullet_per_Sec": 0.17}, "revolver": {"id": "10", "description": "The R8 Revolver delivers a highly accurate and powerful round at the expense of a lengthy trigger-pull. Firing rapidly by fanning the hammer may be the best option when point-blank stopping power is required.", "magazine_size": 8, "Damage_per_bullet": 86, "Bullet_per_Sec": 0.5}, "mp7": {"id": "101", "description": "Versatile but expensive, the German-made MP7 SMG is the perfect choice for high-impact close-range combat.", "magazine_size": 30, "Damage_per_bullet": 29, "Bullet_per_Sec": 0.08}, "mp9": {"id": "102", "description": "Manufactured in Switzerland, the cutting-edge MP9 SMG is an ergonomic polymer weapon favored by private security firms.", "magazine_size": 30, "Damage_per_bullet": 26, "Bullet_per_Sec": 0.07}, "bizon": {"id": "103", "description": "The Bizon SMG is low-damage, but offers a uniquely designed high-capacity drum magazine that reloads quickly.", "magazine_size": 64, "Damage_per_bullet": 27, "Bullet_per_Sec": 0.08}, "mac10": {"id": "104", "description": "Essentially a box that bullets come out of, the MAC-10 SMG boasts a high rate of fire, with poor spread accuracy and high recoil as trade-offs.", "magazine_size": 31, "Damage_per_bullet": 29, "Bullet_per_Sec": 0.075}, "ump": {"id": "105", "description": "The misunderstood middle child of the SMG family, the UMP45's small magazine is the only drawback to an otherwise versatile close-quarters automatic.", "magazine_size": 25, "Damage_per_bullet": 35, "Bullet_per_Sec": 0.09}, "p90": {"id": "106", "description": "Easily recognizable for its unique bullpup design, the P90 is a great weapon to shoot on the move due to its high-capacity magazine and low recoil.", "magazine_size": 50, "Damage_per_bullet": 26, "Bullet_per_Sec": 0.07}, "mp5": {"id": "107", "description": "Often imitated but never equaled, the iconic MP5 is perhaps the most versatile and popular SMG in the world. This SD variant features an integrated silencer, making an already formidable weapon whisper-quiet.", "magazine_size": 30, "Damage_per_bullet": 27, "Bullet_per_Sec": 0.08}, "sawedoff": {"id": "201", "description": "The classic Sawed-Off deals very heavy close-range damage, but with its low accuracy, high spread and slow rate of fire, you'd better kill what you hit.", "magazine_size": 7, "Damage_per_bullet": 32, "Bullet_per_Sec": 0.85}, "nova": {"id": "202", "description": "The Nova's rock-bottom price tag makes it a great ambush weapon for a cash-strapped team.", "magazine_size": 8, "Damage_per_bullet": 26, "Bullet_per_Sec": 0.88}, "swag7": {"id": "203", "description": "The CT-exclusive Mag-7 delivers a devastating amount of damage at close range. Its rapid magazine-style reloads make it a great tactical choice.", "magazine_size": 5, "Damage_per_bullet": 30, "Bullet_per_Sec": 0.85}, "xm1014": {"id": "204", "description": "The XM1014 is a powerful fully automatic shotgun that justifies its heftier price tag with the ability to paint a room with lead fast.", "magazine_size": 7, "Damage_per_bullet": 20, "Bullet_per_Sec": 0.35}, "m249": {"id": "205", "description": "A strong open-area LMG, the M249 is the perfect choice for players willing to trade a slow fire rate for increased accuracy and a high ammo capacity.", "magazine_size": 100, "Damage_per_bullet": 32, "Bullet_per_Sec": 0.08}, "negev": {"id": "206", "description": "The Negev is a beast that can keep the enemy at bay with its pin-point supressive fire, provided you have the luxury of time to gain control over it.", "magazine_size": 150, "Damage_per_bullet": 35, "Bullet_per_Sec": 0.075}, "galil": {"id": "301", "description": "A less expensive option among the terrorist-exclusive assault rifles, the Galil AR is a serviceable weapon in medium to long-range combat.", "magazine_size": 35, "Damage_per_bullet": 30, "Bullet_per_Sec": 0.09}, "famas": {"id": "302", "description": "A cheap option for cash-strapped players, the FAMAS effectively fills the niche between more expensive rifles and the less-effective SMGs.", "magazine_size": 25, "Damage_per_bullet": 30, "Bullet_per_Sec": 0.09}, "ak47": {"id": "303", "description": "Powerful and reliable, the AK-47 is one of the most popular assault rifles in the world. It is most deadly in short, controlled bursts of fire.", "magazine_size": 30, "Damage_per_bullet": 36, "Bullet_per_Sec": 0.1}, "m4a4": {"id": "304", "description": "More accurate but less damaging than its AK-47 counterpart, the M4A4 is the full-auto assault rifle of choice for CTs.", "magazine_size": 30, "Damage_per_bullet": 33, "Bullet_per_Sec": 0.09}, "m4a1": {"id": "305", "description": "With a smaller magazine than its unmuffled counterpart, the silenced M4A1 provides quieter shots with less recoil and better accuracy.", "magazine_size": 25, "Damage_per_bullet": 38, "Bullet_per_Sec": 0.1}, "ssg08": {"id": "306", "description": "The SSG 08 bolt-action is a low-damage but very cost-effective sniper rifle, making it a smart choice for early-round long-range marksmanship.", "magazine_size": 10, "Damage_per_bullet": 88, "Bullet_per_Sec": 1.25}, "sg556": {"id": "307", "description": "The terrorist-exclusive SG 553 is a premium scoped alternative to the AK-47 for effective long-range engagement.", "magazine_size": 30, "Damage_per_bullet": 30, "Bullet_per_Sec": 0.11}, "aug": {"id": "308", "description": "Powerful and accurate, the AUG scoped assault rifle compensates for its long reload times with low spread and a high rate of fire.", "magazine_size": 30, "Damage_per_bullet": 28, "Bullet_per_Sec": 0.1}, "awp": {"id": "309", "description": "High risk and high reward, the infamous AWP is recognizable by its signature report and one-shot, one-kill policy.", "magazine_size": 10, "Damage_per_bullet": 115, "Bullet_per_Sec": 1.455}, "scar20": {"id": "310", "description": "The SCAR-20 is a semi-automatic sniper rifle that trades a high rate of fire and powerful long-distance damage for sluggish movement speed and big price tag.", "magazine_size": 20, "Damage_per_bullet": 80, "Bullet_per_Sec": 0.25}, "g3sg1": {"id": "311", "description": "The pricy G3SG1 lowers movement speed considerably but compensates with a higher rate of fire than other sniper rifles.", "magazine_size": 20, "Damage_per_bullet": 80, "Bullet_per_Sec": 0.25}, "zeus": {"id": "401", "description": "Perfect for close-range ambushes and enclosed area encounters, the single-shot x27 Zeus is capable of incapacitating an enemy in a single hit.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "kevlar": {"id": "402", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "helmet": {"id": "403", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "bomb": {"id": "404", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "knife": {"id": "405", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "defusekit": {"id": "406", "description": "This item is a defuse kit. Once found it greatly reduces the time needed to defuse a live bomb", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "world": {"id": "407", "description": "", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "decoy": {"id": "501", "description": "When thrown, the decoy grenade emulates the sound of the most powerful weapon you are carrying, creating the illusion of additional supporting forces.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "molotov": {"id": "502", "description": "The Molotov is a powerful and unpredictable area denial weapon that bursts into flames when thrown on the ground, injuring any player in its radius.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "incendiary": {"id": "503", "description": "When thrown, the incendiary grenade releases a high-temperature chemical reaction capable of burning anyone within its wide blast radius.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "flash": {"id": "504", "description": "The non-lethal flashbang grenade temporarily blinds anybody within its concussive blast, making it perfect for flushing out closed-in areas. Its loud explosion also temporarily masks the sound of footsteps.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "smoke": {"id": "505", "description": "The smoke grenade creates a medium-area smoke screen. It can effectively hide your team from snipers, or even just create a useful distraction.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}, "he": {"id": "506", "description": "The high explosive fragmentation grenade administers high damage through a wide area, making it ideal for clearing out hostile rooms.", "magazine_size": 0, "Damage_per_bullet": 0, "Bullet_per_Sec": 0}}